#+TITLE: Mini coffee — gamut commercial pipeline (worg validation draft)
#+AUTHOR: hand-mapped from gamut/001-mini-coffee-gamut-dryrun-2026-05-20T14-30-44-540Z
#+CATEGORY: gamut-pipeline
#+TODO: TODO(t) DOING(g) BLOCKED(b@/!) | DONE(d!) FAILED(f@) ABANDONED(a@)
#+PROPERTY: header-args :exports both :dir .

# Maps:
#   - commercial.yaml stages         -> level-1 headlines
#   - tool invocations within stage  -> level-2 headlines OR source blocks
#   - success_criteria               -> level-3 validator headlines under stage
#   - tool args                      -> source-block :header-args
#   - tool stdout/exit                -> #+RESULTS:
#   - state transitions              -> :LOGBOOK:
#   - artifact paths produced        -> :ARTIFACT: properties
#   - inter-stage ordering           -> :DEPENDS_ON: linking by :ID:

** Tool: fs.write brief.md
:PROPERTIES:
:TOOL:        fs.write
:STEP:        4
:COST_USD:    0.0018
:ARTIFACT:    file:./brief.md
:END:

#+begin_src fs-write :path "brief.md"
PRODUCT: A generic ceramic pour-over coffee carafe (no brand)
AUDIENCE: Specialty-coffee enthusiasts who care about brew ritual
INSIGHT: Most ads show coffee being chugged; the ritual is the product
PROMISE: Slow brewing turns morning into a moment
PROOF: Hand-poured, hand-held, hand-watched
TONE: still, observational, A24
MUSIC: ambient piano, single phrase
CALL: Pour better
RUNTIME: 5
#+end_src

#+RESULTS:
: ok=true

** DONE Validator: brief.check
:PROPERTIES:
:KIND:        brief_check_passes
:ARG_PATH:    brief.md
:STEP:        5
:END:

#+begin_src shell :exports both
brief check brief.md
#+end_src

#+RESULTS:
: exit=0
: 3 bytes stdout
: 0 output file(s)

** Tool: screenplay.parse
:PROPERTIES:
:TOOL:     screenplay.parse
:STEP:     7
:ARG_PATH: script.fountain
:ARG_OUT:  screenplay.json
:ARTIFACT: file:./screenplay.json
:END:

#+begin_src shell
gamut screenplay parse --path script.fountain --out screenplay.json
#+end_src

#+RESULTS:
: exit=0

** Tool: velocity.propose
:PROPERTIES:
:TOOL:           velocity.propose
:STEP:           9
:ARG_SCREENPLAY: script.fountain
:ARG_OUT:        velocity.json
:ARTIFACT:       file:./velocity.json
:END:

#+begin_src shell
gamut velocity propose --screenplay script.fountain --out velocity.json
#+end_src

#+RESULTS:
: exit=0

** FAILED Tool: dialogue.tts (live)                          :retry-needed:
CLOSED: [2026-05-20 Tue 14:31:35]
:PROPERTIES:
:TOOL:        gamut.dialogue.tts
:STEP:        17
:ARG_TEXT:    "Pour better."
:ARG_OUT:     vo/NARRATOR-3.mp3
:ARG_BACKEND: elevenlabs
:RETRY_POLICY: max=1 fallback=dry_run
:END:

#+begin_src shell
gamut dialogue tts --text "Pour better." --out vo/NARRATOR-3.mp3 --max-cost 0.05
#+end_src

#+RESULTS:
: exit=2
: stderr=backend elevenlabs: missing credential env var: ELEVENLABS_API_KEY

** TODO Tool: music.gen
:PROPERTIES:
:TOOL:        gamut.music.gen
:STEP:        23
:ARG_PROMPT:  "ambient piano, single phrase"
:ARG_DURATION: 5
:DRY_RUN:     t
:END:

#+begin_src shell
gamut music gen --prompt "ambient piano, single phrase" --duration 5 --out music.mp3 --dry-run
#+end_src

#+RESULTS:
: exit=0
: 373 bytes stdout

